src/ex_Tabakon/Documents/ОтчетОРозничныхПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтчетОРозничныхПродажах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплатыНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПлатежнымиКартами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ОтчетОРозничныхПродажах/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)

	ЕстьПравоРедактирования = ОбщегоНазначенияВызовСервера.ПроверитьВозможностьРедактирования_Общая();

	ТолькоПросмотр = Не ЕстьПравоРедактирования;
	Элементы.ФормаВыгрузитьДокументВФайл.Видимость = ЕстьПравоРедактирования;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Файл собирается на сервере и отдается через ФайловаяСистемаКлиент: запись файла прямо с клиента
// в веб-клиенте недоступна.
//
&НаКлиенте
Процедура ТБКВыгрузитьДокументВФайлПосле(Команда)

	АдресФайла = ТБКПоместитьФайлВыгрузкиВоВременноеХранилище(Объект.Ссылка, УникальныйИдентификатор);

	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл, куда записать документы'");
	ПараметрыСохранения.Диалог.Расширение = "json";
	ПараметрыСохранения.Диалог.Фильтр = НСтр("ru = 'JSON (*.json)|*.json'");

	ИмяФайла = СтрШаблон("ОРП %1.json", СокрЛП(Объект.Номер));

	Оповещение = Новый ОписаниеОповещения("ТБКВыгрузитьДокументВФайлЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, АдресФайла, ИмяФайла, ПараметрыСохранения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик оповещения после сохранения файла в ТБКВыгрузитьДокументВФайлПосле.
//
// Параметры:
//  ПолученныеФайлы - Массив из ОписаниеПереданногоФайла, Неопределено - сохраненный файл; Неопределено, если
//                    сохранение отменено.
//  ДополнительныеПараметры - Неопределено - не используются.
//
&НаКлиенте
Процедура ТБКВыгрузитьДокументВФайлЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ПолученныеФайлы) <> Тип("Массив") Или ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиент.СообщитьПользователю(
		СтрШаблон(НСтр("ru = 'Файл сформирован: %1'"), ПолученныеФайлы[0].Имя));

КонецПроцедуры

// Записывает данные отчета в JSON (UTF-8 без BOM) и помещает файл во временное хранилище формы.
//
// Параметры:
//  Ссылка - ДокументСсылка.ОтчетОРозничныхПродажах - выгружаемый отчет.
//  ИдентификаторФормы - УникальныйИдентификатор - форма, при закрытии которой файл удаляется из хранилища.
//
// Возвращаемое значение:
//  Строка - адрес двоичных данных файла во временном хранилище.
//
&НаСервереБезКонтекста
Функция ТБКПоместитьФайлВыгрузкиВоВременноеХранилище(Ссылка, ИдентификаторФормы)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТБКДанныеОтчетаДляВыгрузки(Ссылка));
	ТекстJSON = ЗаписьJSON.Закрыть();

	Возврат ПоместитьВоВременноеХранилище(
		ПолучитьДвоичныеДанныеИзСтроки(ТекстJSON, КодировкаТекста.UTF8, Ложь), ИдентификаторФормы);

КонецФункции

// Собирает данные записанного отчета для выгрузки в JSON: шапку и строки товаров.
// Без контекста формы: нужна только ссылка, а данные формы ОРП тяжелые (товары, марки).
//
// Параметры:
//  Ссылка - ДокументСсылка.ОтчетОРозничныхПродажах - выгружаемый отчет.
//
// Возвращаемое значение:
//  Массив из Структура - одна структура на отчет; пустой массив, если в отчете нет строк товаров:
//   * Склад - Строка - склад продажи магазина.
//   * СуммаДокумента - Число
//   * Номер - Строка
//   * Дата - Строка
//   * Товары - Массив из Структура - НоменклатураУИ, Номенклатура, ХарактеристикаУИ, Характеристика,
//                                     Количество, Цена.
//
&НаСервереБезКонтекста
Функция ТБКДанныеОтчетаДляВыгрузки(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Отчет.Магазин.СкладПродажи КАК СкладПродажи,
	|	Отчет.СуммаДокумента КАК СуммаДокумента,
	|	Отчет.Номер КАК Номер,
	|	Отчет.Дата КАК Дата
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК Отчет
	|ГДЕ
	|	Отчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОтчета.Номенклатура КАК Номенклатура,
	|	ТоварыОтчета.Характеристика КАК Характеристика,
	|	ТоварыОтчета.Количество КАК Количество,
	|	ТоварыОтчета.Цена КАК Цена
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ТоварыОтчета
	|ГДЕ
	|	ТоварыОтчета.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыОтчета.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результаты = Запрос.ВыполнитьПакет();

	ДанныеОтчета = Новый Массив;

	ВыборкаТовары = Результаты[1].Выбрать();
	Если ВыборкаТовары.Количество() = 0 Тогда
		Возврат ДанныеОтчета;
	КонецЕсли;

	СтрокиТоваров = Новый Массив;
	Пока ВыборкаТовары.Следующий() Цикл
		СтрокиТоваров.Добавить(Новый Структура("НоменклатураУИ, Номенклатура, ХарактеристикаУИ, Характеристика, Количество, Цена",
			Строка(ВыборкаТовары.Номенклатура.УникальныйИдентификатор()),
			Строка(ВыборкаТовары.Номенклатура),
			?(ВыборкаТовары.Характеристика = Неопределено, "", Строка(ВыборкаТовары.Характеристика.УникальныйИдентификатор())),
			?(ВыборкаТовары.Характеристика = Неопределено, "", Строка(ВыборкаТовары.Характеристика)),
			ВыборкаТовары.Количество,
			ВыборкаТовары.Цена));
	КонецЦикла;

	Шапка = Результаты[0].Выбрать();
	Шапка.Следующий();

	ДанныеОтчета.Добавить(Новый Структура("Склад, СуммаДокумента, Номер, Дата, Товары",
		Строка(Шапка.СкладПродажи),
		Шапка.СуммаДокумента,
		Строка(Шапка.Номер),
		Строка(Шапка.Дата),
		СтрокиТоваров));

	Возврат ДанныеОтчета;

КонецФункции

#КонецОбласти
